const countriesUkrainian = [
    "Австралия",
    "Австрия",
    "Аргентина",
    "Бангладеш",
    "Бельгия",
    "Болгария",
    "Боливия",
    "Босния и Герцеговина",
    "Бразилия",
    "Вьетнам",
    "Великобритания",
    "Венесуэла",
    "Германия",
    "Гондурас",
    "Греция",
    "Грузия",
    "Дания",
    "Эгипет",
    "Эквадор",
    "Эсватини",
    "Эстония",
    "Израиль",
    "Индия",
    "Иран",
    "Ирландия",
    "Исландия",
    "Испания",
    "Италия",
    "Казахстан",
    "Канада",
    "Кения",
    "Китай",
    "Кыргызстан",
    "Колумбия",
    "Коста-Рика",
    "Латвия",
    "Литва",
    "Лихтенштейн",
    "Люксембург",
    "Малайзия",
    "Мальта",
    "Марокко",
    "Мексика",
    "Молдова",
    "Нигерия",
    "Нидерланды",
    "Никарагуа",
    "Норвегия",
    "Пакистан",
    "Палау",
    "Парагвай",
    "Перу",
    "Южная Африка",
    "Южная Корея",
    "Южный Судан",
    "Северная Корея",
    "Польша",
    "Португалия",
    "Россия",
    "Румыния",
    "Саудовская Аравия",
    "Сальвадор",
    "Сан-Марино",
    "Сербия",
    "Сингапур",
    "Словения",
    "Соединенные Штаты Америки",
    "Судан",
    "Таджикистан",
    "Таиланд",
    "Тунис",
    "Турция",
    "Туркменистан",
    "Венгрия",
    "Украина",
    "Узбекистан",
    "Уругвай",
    "Финляндия",
    "Франция",
    "Хорватия",
    "Чад",
    "Чехия",
    "Чили",
    "Черногория",
    "Швейцария",
    "Швеция",
    "Шри-Ланка",
    "Ямайка",
    "Япония"
];

const languagesUkrainian = [
    "Английский",
    "Арабский",
    "Бенгальский",
    "Болгарский",
    "Бурский",
    "Датский",
    "Эстонский",
    "Гинди",
    "Греческий",
    "Грузинский",
    "Иврит",
    "Исландский",
    "Испанский",
    "Итальянский",
    "Казахский",
    "Китайский",
    "Латвийский",
    "Литовский",
    "Малайзийский",
    "Мальтийская",
    "Нидерландский",
    "Немецкий",
    "Персидский",
    "Португальский",
    "Русский",
    "Румынский",
    "Свази",
    "Сербский",
    "Сингальский",
    "Словацкий",
    "Словенский",
    "Турецкий",
    "Украинский",
    "Уругвайский",
    "Финский",
    "Французский",
    "Хорватский",
    "Чешский",
    "Чилийский",
    "Шведский",
    "Японский"
];

const countrySelect = $('#countrySelect');

countriesUkrainian.forEach(country => {
    countrySelect.append(`<option value="${country}">${country}</option>`);
});

const languageSelect = $('#languageSelect');

languagesUkrainian.forEach(language => {
    languageSelect.append(`<option value="${language}">${language}</option>`);
});

$(document).ready(function () {
    countrySelect.select2({
        theme: 'custom-theme',
        width: '100%'
    });

    languageSelect.select2({
        theme: 'custom-theme',
        width: '100%'
    });

    $('#select2-countrySelect-container').html('Выберите ГЕО');
    $('#select2-languageSelect-container').html('Выберите язык');
});