const countriesUkrainian = [
    "Австралія",
    "Австрія",
    "Аргентина",
    "Бангладеш",
    "Бельгія",
    "Болгарія",
    "Болівія",
    "Боснія і Герцеговина",
    "Бразилія",
    "В'єтнам",
    "Велика Британія",
    "Венесуела",
    "Германія",
    "Гондурас",
    "Греція",
    "Грузія",
    "Данія",
    "Егіпет",
    "Еквадор",
    "Есватіні",
    "Естонія",
    "Ізраїль",
    "Індія",
    "Іран",
    "Ірландія",
    "Ісландія",
    "Іспанія",
    "Італія",
    "Казахстан",
    "Канада",
    "Кенія",
    "Китай",
    "Киргизстан",
    "Колумбія",
    "Коста-Рика",
    "Латвія",
    "Литва",
    "Ліхтенштейн",
    "Люксембург",
    "Малайзія",
    "Мальта",
    "Марокко",
    "Мексика",
    "Молдова",
    "Нігерія",
    "Нідерланди",
    "Нікарагуа",
    "Норвегія",
    "Пакистан",
    "Палау",
    "Парагвай",
    "Перу",
    "Південна Африка",
    "Південна Корея",
    "Південний Судан",
    "Північна Корея",
    "Польща",
    "Португалія",
    "Росія",
    "Румунія",
    "Саудівська Аравія",
    "Сальвадор",
    "Сан-Марино",
    "Сербія",
    "Сингапур",
    "Словенія",
    "Сполучені Штати Америки",
    "Судан",
    "Таджикистан",
    "Таїланд",
    "Туніс",
    "Туреччина",
    "Туркменістан",
    "Угорщина",
    "Україна",
    "Узбекистан",
    "Уругвай",
    "Фінляндія",
    "Франція",
    "Хорватія",
    "Чад",
    "Чехія",
    "Чилі",
    "Чорногорія",
    "Швейцарія",
    "Швеція",
    "Шри-Ланка",
    "Ямайка",
    "Японія"
];

const languagesUkrainian = [
    "Англійська",
    "Арабська",
    "Бенгальська",
    "Болгарська",
    "Бурська",
    "Данська",
    "Естонська",
    "Гінді",
    "Грецька",
    "Грузинська",
    "Іврит",
    "Ісландська",
    "Іспанська",
    "Італійська",
    "Казахська",
    "Китайська",
    "Латвійська",
    "Литовська",
    "Малайзійська",
    "Мальтійська",
    "Нідерландська",
    "Німецька",
    "Перська",
    "Португальська",
    "Російська",
    "Румунська",
    "Свазі",
    "Сербська",
    "Сингальська",
    "Словацька",
    "Словенська",
    "Турецька",
    "Українська",
    "Уругвайська",
    "Фінська",
    "Французька",
    "Хорватська",
    "Чеська",
    "Чилійська",
    "Шведська",
    "Японська"
];

const countrySelect = $('#countrySelect');

countriesUkrainian.forEach(country => {
    countrySelect.append(`<option value="${country}">${country}</option>`);
});

const languageSelect = $('#languageSelect');

languagesUkrainian.forEach(language => {
    languageSelect.append(`<option value="${language}">${language}</option>`);
});

$(document).ready(function () {
    countrySelect.select2({
        theme: 'custom-theme',
        width: '100%'
    });

    languageSelect.select2({
        theme: 'custom-theme',
        width: '100%'
    });


    $('#countrySelect').val(null);
    $('#languageSelect').val(null);

    $('#select2-countrySelect-container').html('Виберіть ГЕО');
    $('#select2-languageSelect-container').html('Виберіть мову');
});
